<?php

return [
    'app_name'        => 'Менеджер задач',
    'form'            => [
        'create'  => 'Создать',
        'actions' => 'Действия',
        'delete'  => 'Удалить',
        'edit'    => 'Изменить',
        'apply'   => 'Применить',
        'update'  => 'Обновить',
    ],
    'model'           => [
        'id'          => 'ID',
        'status'      => 'Статус',
        'name'        => 'Имя',
        'description' => 'Описание',
        'author'      => 'Автор',
        'assign'      => 'Исполнитель',
        'labels'      => 'Метки',
        'created_at'  => 'Дата создания',
        'save'        => 'Создать',
    ],
    'placeholders'    => [
        'status' => 'Статус',
        'author' => 'Автор',
        'assign' => 'Исполнитель',
    ],
    'welcome'         => [
        'hello'      => 'Привет от Хекслета!',
        'subject'    => 'Практические курсы по программированию',
        'learn_more' => 'Узнать больше',
    ],
    'titles'          => [
        'status' => [
            'create' => 'Создать статус',
            'update' => 'Изменение статуса',
        ],
        'label'  => [
            'create' => 'Создать метку',
            'update' => 'Изменение метки',
        ],
        'task'   => [
            'create' => 'Создать задачу',
            'update' => 'Изменение задачи',
            'show'   => 'Просмотр задачи',
        ],
    ],
    'flash'           => [
        'label'  => [
            'delete' => [
                'success' => 'Метка успешно удалена',
                'error'   => 'Не удалось удалить метку',
            ],
            'create' => 'Метка успешно создана',
            'update' => 'Метка успешно изменена',
        ],
        'status' => [
            'delete' => [
                'success' => 'Статус успешно удалён',
                'error'   => 'Не удалось удалить статус',
            ],
            'create' => 'Статус успешно создан',
            'update' => 'Статус успешно изменён',
        ],
        'task'   => [
            'delete' => [
                'success' => 'Задача успешно удалена',
                'error'   => 'Не удалось удалить задачу',
            ],
            'create' => 'Задача успешно создана',
            'update' => 'Задача успешно изменена',
        ],
    ],
    'registration'    => [
        'name'             => 'Имя',
        'password'         => 'Пароль',
        'confirm_password' => 'Подтверждение',
        'register'         => 'Зарегистрировать',
        'title'            => 'Регистрация',
        'email'            => 'Email',
    ],
    'login'           => [
        'email'           => 'Email',
        'password'        => 'Пароль',
        'title'           => 'Вход',
        'login'           => 'Вход',
        'remember_me'     => 'Запомнить меня',
        'forgot_password' => 'Забыли пароль?',
    ],
    'forgot_password' => [
        'title'          => 'Сброс пароля',
        'email'          => 'Email',
        'reset_password' => 'Сбросить пароль',
    ],
];

